In [39]:
import pandas as pd

In [41]:
people = {
    "first": ["Corey", "Jane", "John"],
     "last": ["Shafer", "Doe", "Doe"],
    "email": ["CoreyMShafer@gmail.com", "JaneDoe@gmaio.com", "JohnDoe@gmail.com"]
}

In [42]:
df = pd.DataFrame(people)

In [43]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [6]:
df['first'] + " " + df["last"]

0    Corey Shafer
1        Jane Doe
2        John Doe
dtype: object

In [7]:
df["full_name"] = df['first'] + " " + df["last"]

In [44]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [12]:
df.drop(columns=["first", "last"], inplace=True)

In [24]:
df

                    email     full_name  first    last
0  CoreyMShafer@gmail.com  Corey Shafer  Corey  Shafer
1       JaneDoe@gmaio.com      Jane Doe   Jane     Doe
2       JohnDoe@gmail.com      John Doe   John     Doe

In [16]:
df["full_name"].str.split(" ")

0    [Corey, Shafer]
1        [Jane, Doe]
2        [John, Doe]
Name: full_name, dtype: object

In [ ]:
df["full_name"].str.split(" ", expand=True)

       0       1
0  Corey  Shafer
1   Jane     Doe
2   John     Doe

In [ ]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [45]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

#### Adding and removing rows of data

In [46]:
# # add a single row append has been officially replaced to concat
# df.append({"first": "Tony"})
new_row = pd.DataFrame([{"first": "Tony"}])

pd.concat([df, new_row])

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com
0   Tony     NaN                     NaN

In [47]:
df = pd.concat([df, new_row])
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com
0   Tony     NaN                     NaN

In [48]:
people = {
    "first": ["Tony", "Steve" ],
     "last": ["Stark", "Rogers"],
    "email": ["IronMan@avenge.com", "Cap@gmaio.com"]
}

In [49]:
df2 = pd.DataFrame(people)

In [50]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers       Cap@gmaio.com

In [51]:
pd.concat([df, df2], sort=False)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com
0   Tony     NaN                     NaN
0   Tony   Stark      IronMan@avenge.com
1  Steve  Rogers           Cap@gmaio.com

In [54]:
df = pd.concat([df, df2], sort=False, ignore_index=True)

In [55]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com
3   Tony     NaN                     NaN
4   Tony   Stark      IronMan@avenge.com
5  Steve  Rogers           Cap@gmaio.com
6   Tony   Stark      IronMan@avenge.com
7  Steve  Rogers           Cap@gmaio.com

#### Removing Rows

In [57]:
df.drop(index=7)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com
3   Tony     NaN                     NaN
4   Tony   Stark      IronMan@avenge.com
5  Steve  Rogers           Cap@gmaio.com
6   Tony   Stark      IronMan@avenge.com

In [59]:
filt = df['last']=="Doe"
df.drop( index=df[filt].index)

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
3   Tony     NaN                     NaN
4   Tony   Stark      IronMan@avenge.com
5  Steve  Rogers           Cap@gmaio.com
6   Tony   Stark      IronMan@avenge.com
7  Steve  Rogers           Cap@gmaio.com